remote-results/confluence/confluence/2021-04-23_04-25-22/effective.yml
---
cli:
  linter:
    disable: false
    ignored-warnings: []
    lint-and-exit: false
    warn-on-unfamiliar-fields: false
cli-aliases:
  cloud:
    provisioning: cloud
  detach:
    modules:
      cloud:
        detach: true
  func:
    modules:
      console:
        disable: true
    settings:
      aggregator: functional-consolidator
  gui:
    modules:
      jmeter:
        gui: true
  install-tools:
    services:
    - install-checker
  lint:
    cli:
      linter:
        lint-and-exit: true
  local:
    provisioning: local
  locations:
    modules:
      cloud:
        dump-locations: true
    provisioning: cloud
  nolint:
    cli:
      linter:
        disable: true
  public:
    modules:
      blazemeter:
        public-report: true
  report:
    reporting:
    - blazemeter
  sequential:
    modules:
      local:
        sequential: true
execution:
- concurrency:
    local: '200'
  executor: jmeter
  hold-for: 45m
  ramp-up: 5m
  scenario: jmeter
  throughput: {}
- executor: selenium
  files: []
  hold-for: 45m
  runner: pytest
  scenario: selenium
included-configs: []
install-id: Docker
modules:
  ab:
    class: bzt.modules.ab.ApacheBenchmarkExecutor
  android-emulator:
    class: bzt.modules.services.AndroidEmulatorLoader
  apiritif:
    class: bzt.modules.apiritif.ApiritifNoseExecutor
  appium:
    class: bzt.modules.services.AppiumLoader
  blazemeter:
    class: bzt.modules.blazemeter.BlazeMeterUploader
  capturehar:
    class: bzt.modules.blazemeter.ServiceStubCaptureHAR
  cloud:
    class: bzt.modules.blazemeter.CloudProvisioning
    default-location: us-central1-a
  console:
    class: bzt.modules.console.ConsoleStatusReporter
    disable: true
  consolidator:
    class: bzt.modules.aggregator.ConsolidatingAggregator
    percentiles: []
    rtimes-len: 0
  external-results-loader:
    class: bzt.modules.external.ExternalResultsLoader
  final-stats:
    class: bzt.modules.reporting.FinalStatus
  final_stats:
    class: bzt.modules.reporting.FinalStatus
  functional-consolidator:
    class: bzt.modules.functional.FunctionalAggregator
  gatling:
    class: bzt.modules.gatling.GatlingExecutor
    properties:
      gatling.data.file.bufferSize: 256
  grinder:
    class: bzt.modules.grinder.GrinderExecutor
    properties:
      grinder.useConsole: false
  install-checker:
    class: bzt.modules.services.InstallChecker
  jmeter:
    class: bzt.modules.jmeter.JMeterExecutor
    detect-plugins: true
    memory-xmx: 8G
    path: /root/.bzt/jmeter-taurus/5.4.1/bin/jmeter.sh
    plugins:
    - jpgc-casutg
    - jpgc-dummy
    - jpgc-ffw
    - jpgc-fifo
    - jpgc-functions
    - jpgc-json
    - jpgc-perfmon
    - jpgc-prmctl
    - jpgc-tst
    - bzm-parallel=0.4
    - bzm-random-csv=0.6
    - jpgc-casutg=2.5
    - jpgc-dummy=0.2
    - jpgc-ffw=2.0
    - jpgc-fifo=0.2
    - jpgc-functions=2.1
    - jpgc-json=2.6
    - jpgc-perfmon=2.1
    - jpgc-prmctl=0.4
    - jpgc-tst=2.4
    - jpgc-wsc=0.3
    - tilln-sshmon=1.0
    - jpgc-synthesis=2.2
    properties:
      jmeter.save.saveservice.autoflush: 'true'
      jmeter.save.saveservice.connect_time: 'true'
      jmeterengine.force.system.exit: 'true'
      summariser.name: ''
    protocol-handlers:
      http: bzt.jmx.http.HTTPProtocolHandler
    system-properties:
      httpsampler.ignore_failed_embedded_resources: 'true'
      java.rmi.server.hostname: localhost
      server.rmi.ssl.disable: true
    version: 5.4.1
  junit:
    class: bzt.modules.java.JUnitTester
  junit-xml:
    class: bzt.modules.reporting.JUnitXMLReporter
  local:
    class: bzt.modules.provisioning.Local
  locust:
    class: bzt.modules.locustio.LocustIOExecutor
  mocha:
    class: bzt.modules.javascript.MochaTester
  molotov:
    class: bzt.modules.molotov.MolotovExecutor
  monitoring:
    class: bzt.modules.monitoring.Monitoring
  newman:
    class: bzt.modules.javascript.NewmanExecutor
  nunit:
    class: bzt.modules.csharp.NUnitExecutor
  passfail:
    class: bzt.modules.passfail.PassFailStatus
  pip-install:
    class: bzt.modules.services.PipInstaller
  proxy2jmx:
    class: bzt.modules.proxy2jmx.Proxy2JMX
  pytest:
    class: bzt.modules.pytest.PyTestExecutor
  robot:
    class: bzt.modules.robot.RobotExecutor
  rspec:
    class: bzt.modules.ruby.RSpecTester
  screenshoter:
    class: bzt.modules.blazemeter.ServiceStubScreenshoter
  selenium:
    chromedriver:
      version: 89.0.4389.23
    class: bzt.modules.selenium.SeleniumExecutor
  shellexec:
    class: bzt.modules.shellexec.ShellExecutor
  siege:
    class: bzt.modules.siege.SiegeExecutor
  testng:
    class: bzt.modules.java.TestNGTester
  tsung:
    class: bzt.modules.tsung.TsungExecutor
  unpacker:
    class: bzt.modules.services.Unpacker
  virtual-display:
    class: bzt.modules.services.VirtualDisplay
  wdio:
    class: bzt.modules.javascript.WebdriverIOExecutor
  xunit:
    class: bzt.modules.csharp.XUnitExecutor
provisioning: local
reporting:
- module: final-stats
- module: console
- data-source: sample-labels
  filename: /dc-app-performance-toolkit/app/results/confluence/2021-04-23_04-25-22/xunit.xml
  module: junit-xml
scenarios:
  jmeter:
    properties:
      application_hostname: confs-loadb-1bytspbypdfbc-1945029135.us-west-2.elb.amazonaws.com
      application_port: '80'
      application_postfix: ''
      application_protocol: http
      perc_comment_page: '5'
      perc_create_and_edit_page: '6'
      perc_create_blog: '3'
      perc_like_page: '3'
      perc_search_cql: '7'
      perc_standalone_extension: '0'
      perc_upload_attachment: '5'
      perc_view_attachment: '3'
      perc_view_blog: '8'
      perc_view_dashboard: '6'
      perc_view_page: '54'
      total_actions_per_hr: '20000'
    script: /dc-app-performance-toolkit/app/jmeter/confluence.jmx
  locust:
    script: locustio/confluence/locustfile.py
  selenium:
    script: /dc-app-performance-toolkit/app/selenium_ui/confluence_ui.py
services:
- local:
  - metrics:
    - cpu
    - mem
    - bytes-sent
    - bytes-recv
    - disk-read
    - disk-write
    - disk-space
    - engine-loop
    - conn-all
  module: monitoring
- module: shellexec
  post-process:
  - command: python util/analytics/analytics.py confluence
  - command: python util/post_run/cleanup_results_dir.py
  prepare:
  - command: python util/pre_run/environment_checker.py
  - command: python util/data_preparation/confluence_prepare_data.py
  shutdown:
  - command: python util/post_run/jmeter_post_check.py
  - command: python util/jtl_convertor/jtls-to-csv.py kpi.jtl selenium.jtl
settings:
  aggregator: consolidator
  artifacts-dir: results/confluence/%Y-%m-%d_%H-%M-%S
  default-executor: jmeter
  env:
    JMETER_VERSION: 5.4.1
    LANGUAGE: en_US.utf8
    OBJC_DISABLE_INITIALIZE_FORK_SAFETY: 'YES'
    TAURUS_ARTIFACTS_DIR: /dc-app-performance-toolkit/app/results/confluence/2021-04-23_04-25-22
    WEBDRIVER_VISIBLE: 'False'
    admin_login: admin
    admin_password: '********'
    allow_analytics: 'True'
    application_hostname: confs-loadb-1bytspbypdfbc-1945029135.us-west-2.elb.amazonaws.com
    application_port: '80'
    application_postfix: null
    application_protocol: http
    comment_page: '5'
    concurrency: '200'
    create_and_edit_page: '6'
    create_blog: '3'
    custom_dataset_query: null
    like_page: '3'
    load_executor: jmeter
    ramp-up: 5m
    search_cql: '7'
    secure: 'True'
    standalone_extension: '0'
    test_duration: 45m
    total_actions_per_hour: '20000'
    upload_attachment: '5'
    view_attachment: '3'
    view_blog: '8'
    view_dashboard: '6'
    view_page: '54'
  verbose: false
version: 1.15.2